{"data":{"site":{"siteMetadata":{"siteUrl":"http://ghost.local:8000","title":"vwa.la help","description":"Everything you need to know about the vwa.la influencer marketing platform."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c34d4455bb57200bfdf719c","slug":"api-versioning","title":"API Versioning","excerpt":"The v2 Content API is stable  as of Ghost v2.10.0. The v2 Admin API is still\nunder development (experimental) and not yet ready for production use. Each\nmajor version of Ghost ships with at least 2 versions of the APIs. Each version\nof an API has a status, which indicates suitability for production use. The \ncore\nAPI guide [https://docs.ghost.org/concepts/core/]  describes the purpose of each\nAPI.\n\nHere is the current status of the APIs:\n\nAPIv0.1v2Content APIdeprecated (Public API)stableAdmin AP","feature_image":null,"plaintext":"The v2 Content API is stable  as of Ghost v2.10.0. The v2 Admin API is still\nunder development (experimental) and not yet ready for production use. Each\nmajor version of Ghost ships with at least 2 versions of the APIs. Each version\nof an API has a status, which indicates suitability for production use. The \ncore\nAPI guide [https://docs.ghost.org/concepts/core/]  describes the purpose of each\nAPI.\n\nHere is the current status of the APIs:\n\nAPIv0.1v2Content APIdeprecated (Public API)stableAdmin APIdeprecated (Private\nAPI)experimentalStability Index:\n\n * experimental - being actively worked on, may receive breaking changes\n * stable - forward compatible changes only\n * maintenance - no changes, security fixes only\n * deprecated - scheduled for removal \n\nGhost major versions [/faq/major-versions-lts/]  ship every 8-12 months, meaning\ncode you write against our API today will be stable for a minimum of 2 years.","featured":false,"created_at_pretty":"08 January, 2019","published_at_pretty":"08 January, 2019","updated_at_pretty":"08 January, 2019","created_at":"2019-01-08T16:48:05.000+00:00","published_at":"2019-01-08T18:05:17.000+00:00","updated_at":"2019-01-08T18:05:17.000+00:00","tags":[{"name":"General","slug":"general","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Hannah Wolfe","slug":"hannah"}]}},{"node":{"id":"Ghost__Post__5bd7cff74b8b9800bf8d3a3c","slug":"major-versions-lts","title":"Major Versions & Long Term Support","excerpt":"Major version release dates and end of life support for Ghost.","feature_image":null,"plaintext":"Here are the major version release dates and end of life support for Ghost: \n\nVersionReleasedEnd of LifeGhost 0.x20132019Ghost 1.x20172020Ghost 2.x20182021\nGhost 3.x20192022For developers managing a self-hosted version of Ghost, use the\nfollowing guides for upgrades from LTS versions to the latest major version: \n\n * Upgrading to Ghost 1.0 [https://docs.ghost.org/faq/upgrade-to-ghost-1-0/]\n * Upgrading to Ghost 2.0 [https://docs.ghost.org/faq/upgrade-to-ghost-2-0/]\n\nIf you are using Ghost(Pro) [https://ghost.org/pricing/]  then you are\nautomatically upgraded to the latest version of Ghost.","featured":false,"created_at_pretty":"30 October, 2018","published_at_pretty":"30 October, 2018","updated_at_pretty":"30 October, 2018","created_at":"2018-10-30T03:28:55.000+00:00","published_at":"2018-10-30T04:06:07.000+00:00","updated_at":"2018-10-30T11:03:33.000+00:00","tags":[{"name":"General","slug":"general","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Kym Ellis","slug":"kym"}]}},{"node":{"id":"Ghost__Post__5bc9b21894250c00bf9d3d86","slug":"ghost-gdpr-compliance","title":"Ghost GDPR compliance","excerpt":"We act as both a data processor and a data controller under the GDPR. Read more about GDPR compliance at Ghost.","feature_image":null,"plaintext":"We act as both a data processor and a data controller under the GDPR.\n\nWhen customers use our products and services to process EU personal data, we act\nas a data processor. For example, we will be a processor of EU personal data and\ninformation that gets uploaded into a Ghost site. \n\nWe act as a data controller for the EU customer information we collect to\nprovide our products and services and to provide timely customer support. This\ncustomer information includes things such as customer name and contact\ninformation.\n\nWhat personal data do we collect and store from our customers?\nWe store data that customers have given us voluntarily. For example, in our role\nas data controller, we may collect and store contact information such as name\nand email address when customers sign up for our products and services or seek\nsupport. We also may collect other identifying information from our customers,\nsuch as IP address.\n\nWe separately act as a data processor when customers use our products and\nservices to process EU personal data, such as uploading personal data to a Ghost\nsite. Customers decide what personal data, if any, is uploaded to our products\nand services.\n\nWhat is the Ghost Data Processing Agreement (\"DPA\")?\nCustomers that handle EU personal data are required to comply with the privacy\nand security requirements under the GDPR. As part of this, they must ensure that\nthe vendors they use to process the EU personal data also have privacy and\nsecurity protections in place. Our DPA outlines the privacy and security\nprotections we have in place. We are committed to GDPR compliance and to helping\nour customers comply with the GDPR when they use our services. We have therefore\nmade our DPA available to all our customers and it can be found here: Data\nProcessing Agreement [https://ghost.org/dpa/].\n\nAre customers required to sign the Ghost DPA?\nIn order to use our products and services, you need to accept our DPA, which we\nhave provided a link to on our website: Data Processing Agreement\n[https://ghost.org/dpa/]. By agreeing to our terms of service, you are\nautomatically accepting our DPA and do not need to sign a separate document.\n\nCan a customer share the Ghost DPA with its customers?\nYes. The DPA is a publicly available document and customers who wish to share it\nwith their customers to confirm our security measures and other terms may feel\nfree to do so.\n\nDo customers need to notify anyone upon accepting our DPA?\nNo. You are not required to notify us or any third party upon accepting our DPA\nthough, as mentioned above, you are free to do so.\n\nAre there unique DPA needs for individual countries?\nThe GDPR applies to all of the EU and we offer a DPA that is compliant in all EU\ncountries.\n\nDo we transfer data internationally?\nGhost stores all data in the EU. In certain circumstances, we will process\npersonal data that originates from the EU in outside of the EU when conducting\nsupport and maintenance of our services. We provide a level of protection of\nprivacy that complies with the EU rules.\n\nHow do we handle delete instructions from customers?\nCustomers have the ability to remove or delete information they have uploaded to\nour products. Likewise, customers may deactivate their account and request that\nall personal data we have collected and stored is deleted. Log into your account\nat my.ghost.org for further instructions.\n\nHow can a customer view and download content from our services and transfer it\nto another provider?\nYou can easily download all content from a Ghost site at any time by exporting\ncontent or theme using the UI provided within Ghost Admin. If you wish to\ndownload a copy of your image assets, we are also more than happy to provide\nthose by emailing support@ghost.org.","featured":false,"created_at_pretty":"19 October, 2018","published_at_pretty":"19 October, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-10-19T10:29:44.000+00:00","published_at":"2018-10-19T10:30:47.000+00:00","updated_at":"2018-10-23T08:27:06.000+00:00","tags":[{"name":"General","slug":"general","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"John O'Nolan","slug":"john"}]}},{"node":{"id":"Ghost__Post__5bc987df94250c00bf9d3d50","slug":"analytics","title":"How can I track how many views my site is getting?","excerpt":"Ghost integrates very easily with all 3rd party analytics tools out there, which take just a few minutes to set up using the code injection feature.","feature_image":null,"plaintext":"Ghost integrates very easily with all 3rd party analytics tools out there, which\ntake just a few minutes to set up.\n\nHow to set up simple analytics for Ghost\nHead over to your analytics provider of choice (eg. Google Analytics\n[https://analytics.google.com]) and create a new property. They will provide you\nwith a tracking code, which you can then paste into the \"Foot\" section of your \nCode Injection  settings in Ghost Admin.\n\nSave the settings, and you're all done! You'll now have full, detailed analytics\nfor every page on your site.\n\nWhy doesn't Ghost have analytics built-in?\nBecause building analytics is an incredibly complicated thing to do, and even\nmore complicated to do accurately, so we would really be fighting a losing\nbattle. Google have tens of thousands of engineers, their product is completely\nfree, and it's extremely good. We have 5 engineers, could not afford to build a\nsecondary product this complex, and if we did - it would be demonstrably\nless-good than Google Analytics. So unfortunately the economics just don't make\nsense.\n\nThis is actually a good thing for users, though. When products have analytics \nbuilt-in  they're unanimously\n[http://fortune.com/2018/10/17/advertisers-facebook-video-metrics/]  inaccurate\n[https://www.wsj.com/articles/advertisers-allege-facebook-failed-to-disclose-key-metric-error-for-more-than-a-year-1539720524] \n and deceptive [https://www.thewrap.com/facebook-inflated-video-views-lawsuit/].\nYou never know where the numbers are coming from or if you can trust them. Using\na proper analytics service is a much  better choice all round!","featured":false,"created_at_pretty":"19 October, 2018","published_at_pretty":"19 October, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-10-19T07:29:35.000+00:00","published_at":"2018-10-19T07:44:51.000+00:00","updated_at":"2018-10-23T08:28:00.000+00:00","tags":[{"name":"General","slug":"general","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"John O'Nolan","slug":"john"}]}},{"node":{"id":"Ghost__Post__5bc6f01794250c00bf9d3cf3","slug":"wheres-the-dashboard","title":"Where's the dashboard?","excerpt":"The dashboard was an early prototype idea for Ghost which was retired in 2015 after determining that it was not viable.","feature_image":null,"plaintext":"The dashboard was an early prototype idea for Ghost which was retired in 2015\nafter determining that it was not viable.\n\nAs we started looking into the viability and complexity of building a\ncomprehensive analytics dashboard which would pull all your relevant site\nmetrics into one place we came across more questions than answers.\n\nAll the paths we explored ended in creating a bad product. So in the end we had\nto decide between shipping something below our standards (and then suffering\nthrough maintaining it for the rest of time) – or letting the idea go. We opted\nfor the latter. The dashboard was a lovely, but ultimately impractical idea!\n\nFortunately, though, you can still make the dashboard yourself really easily\nusingGeckoboard [https://geckoboard.com], which is a fully thought-out,\nfeature-complete product (with a team over 3x the size of Ghost's).\n\nThe original Ghost dashboard concept, recreated in Geckoboard\n[https://share.geckoboard.com/dashboards/DGMZGZVU62VIFKGA]Here's more\ninformation about using Geckoboard and Ghost\n[https://docs.ghost.org/integrations/geckoboard/]  together.","featured":false,"created_at_pretty":"17 October, 2018","published_at_pretty":"17 October, 2018","updated_at_pretty":"30 October, 2018","created_at":"2018-10-17T08:17:27.000+00:00","published_at":"2018-10-17T08:33:21.000+00:00","updated_at":"2018-10-30T08:36:55.000+00:00","tags":[{"name":"General","slug":"general","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"John O'Nolan","slug":"john"}]}},{"node":{"id":"Ghost__Post__5bc6ec7b94250c00bf9d3ccc","slug":"why-havent-you-built-x-yet","title":"Why haven't you built [feature x] yet?","excerpt":"Ghost is a completely open source product, which means that other than a very few full-time salaried employees of the non-profit organisation which steward it.","feature_image":null,"plaintext":"Great question! But the deeper question is: Why haven't you? 😊\n\nGhost is a completely open source product, which means that other than a very\nfew full-time salaried employees of the non-profit organisation which steward it\n– it's built almost entirely by a small group of volunteers.\n\nNow, it's impossible for our little core team and small group of volunteers to\nwork on every single thing - and, of course, they have their own ideas about\nwhat to build next, too!\n\nWith a closed platform, you have no recourse if the core team isn't focused on\nyour pet feature. The conversation ends there. The entire point of open source\nis that if you're knowledgeable and passionate about something which would\nimprove the software, then you are still able to implement it yourself. \n\nThat is the freedom which open source grants you.\n\nIf you choose to send your implementation upstream in the form of a Pull\nRequest, and it is accepted as a good approach which will work for all users and\nnot just you, then it can be accepted for others to also benefit from your work.\n\nIf you don't have the ability or the inclination to build a feature yourself,\nthen you can always pay someone else to build it for you – commonly known as\nsponsoring an issue. Either you have a motivation to build it yourself, or you\nprovide someone else with an economic motivation to build it for you.\n\nNot every feature makes it upstream, though. It may be that you build something\ncustom just for yourself. That's ok too. For example, Apple use Ghost internally\nto run hundreds of micro-sites for their different teams, but their own security\npolicies meant that they elected to fork and remove Ghost's user system and\nreplace it with a SAML implementation that was compatible with their corporate\nauth. Totally fine. Not something which will ever make it upstream. But the fact\nthat Ghost is open source meant they were able to do it.\n\nMost features in Ghost start out with someone wondering why something doesn't\nexist yet, and then deciding to build it themselves.\n\nIf you're interested in contributing to Ghost, here's a guide\n[https://docs.ghost.org/concepts/contributing/]  to help get started.","featured":false,"created_at_pretty":"17 October, 2018","published_at_pretty":"17 October, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-10-17T08:02:03.000+00:00","published_at":"2018-10-17T08:14:00.000+00:00","updated_at":"2018-10-23T08:30:16.000+00:00","tags":[{"name":"General","slug":"general","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"John O'Nolan","slug":"john"}]}}]}},"pageContext":{"tagSlug":"general","tagName":"General","tagURL":"/faq/general/","tagDescription":null,"tagImage":null,"tagMetaTitle":null,"tagMetaDescription":null,"section":"faq"}}