{"data":{"site":{"siteMetadata":{"siteUrl":"http://ghost.local:8000","title":"vwa.la help","description":"Everything you need to know about the vwa.la influencer marketing platform."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5bc56b4094250c00bf9d3c44","slug":"posts-per-page","title":"How do I edit posts per page?","excerpt":"You can set the number of posts per page on your Ghost publication in your theme files.","feature_image":null,"plaintext":"The posts per page setting is controlled by your theme in the package.json \nfile. The default is 5 posts per page, but you can edit it to anything you\nrequire.\n\nHow to edit posts per page in Ghost\nIf you would like to change the number of posts that appear on a page on your\npublication, update your package.json  config file using posts_per_page:\n\nExample: \n\n\"config\": {    \"posts_per_page\": 7}\n\n\n\n\nFor more information about the package.json  file, visit the config guide\n[https://docs.ghost.org/concepts/config].","featured":false,"created_at_pretty":"16 October, 2018","published_at_pretty":"16 October, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-10-16T04:38:24.000+00:00","published_at":"2018-10-16T04:41:12.000+00:00","updated_at":"2018-10-23T08:41:18.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Kym Ellis","slug":"kym"}]}},{"node":{"id":"Ghost__Post__5bbb629e8e5a4f00bfae4de3","slug":"organising-content","title":"Organising content in Ghost","excerpt":"Ghost has a flexible organisational taxonomy called tags, which can be assigned from post settings menu within the Ghost editor.","feature_image":null,"plaintext":"Ghost has a flexible organisational taxonomy called  tags, which can be assigned\nfrom post settings menu [https://docs.ghost.org/faq/publishing-options/]  within\nthe Ghost editor [https://docs.ghost.org/faq/using-the-editor/].\n\nTagging\nBy tagging posts with one or more keyword, you can organise articles into\nrelated content.\n\nFor example you may tag some content with News and other content with Podcast,\nwhich would create two distinct categories of content listed on /tag/news/  and \n/tag/weather/, respectively.\n\nIf you tag a post with both News  and  Weather  - then it appears in both\nsections. Tag archives are like dedicated home-pages for each category of\ncontent that you have. They have their own pages, their own RSS feeds, and can\nsupport their own cover images and meta data.\n\nPrimary Tag\nTags can drag and dropped into a specific order from the post settings menu. The\nfirst tag in the list is always given the most importance, and some themes will\nonly display the primary tag (the first tag in the list) by default.\n\nNews, Technology, StartupPrivate Tags\nIn Ghost, hashtags are private tags and can be used for special styling. \n\nFor example, if you sometimes publish posts with video content - you might want\nyour theme to adapt and get rid of the sidebar for these posts, to give more\nspace for an embedded video to fill the screen. \n\nNews, #videoHere, the theme would assign the post publicly displayed tag of News\n- but it would also keep a private record of the post being tagged with #video. \n\nYou can find documentation for theme development techniques like this and many\nmore over on Ghost's extensive theme documentation\n[https://docs.ghost.org/api/handlebars-themes/].\n\nPosts & pages\nThere are two types of content in Ghost than can be organised with tags: posts\n[https://docs.ghost.org/concepts/posts/]  and pages\n[https://docs.ghost.org/concepts/pages/]. Posts are the primary content type and\nposts will belong to an index page or collection of posts. Pages are generally\nused for static one-off content, and are excluded from all feeds. Find out more\nabout posts and pages in the core concepts guide\n[https://docs.ghost.org/concepts/posts/].","featured":false,"created_at_pretty":"08 October, 2018","published_at_pretty":"08 October, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-10-08T13:58:54.000+00:00","published_at":"2018-10-08T14:28:32.000+00:00","updated_at":"2018-10-23T08:30:46.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bb3a9a55a8ccb00bfd27ace","slug":"using-the-editor","title":"Using the editor","excerpt":"Ghost has a powerful visual editor with familiar formatting options, as well as the ability to seamlessly add dynamic content. ","feature_image":null,"plaintext":"Ghost has a powerful visual editor with familiar formatting options, as well as\nthe ability to seamlessly add dynamic content. \n\nUnder the hood the editor delivers power and flexibility, with the ability to\nquickly add content such as images, galleries, videos, embeds and code!\n\nRich editing at your fingertips\nUsing the contextual toolbar allows you to efficiently format your text, add\nlinks and insert rich media. \n\nUsing the dynamic menu\nYou can insert a card either by clicking the+   button on a new line, or typing/ \n on a new line to search for a particular card. This allows you to insert \nimages, markdown, html, galleries  and embeds.\n\nFor Example:\n\n * Insert a video from YouTube directly into your content by pasting the URL\n * Create unique content like a button or content opt-in using the HTML card\n * Need to share some code? Embed code blocks directly\n * Can't find a good image? Use the Unsplash integration to find and insert free\n   photos\n\nThere are several ways to enhance your content using cards – see the full list\nof current integrations [https://docs.ghost.org/integrations/]. \n\nUsing Markdown\nWe know that many Ghost users love writing with Markdown\n[http://commonmark.org/]  - so the editor will automatically parse Markdown\ntyped in directly. Alternatively, insert a Markdown card to access all of the\nsame features of previous versions of the Ghost editor inside a single card 😎\n\nMarkdown reference\nResultMarkdownShortcutBold**text** / __text__Ctrl/⌘ + BEmphasize*text*Ctrl/⌘ + I\nStrike-through~~text~~Ctrl + Alt + UTesttext^supertext^\nTextsubtext~subtext~\nLink [http://support.ghost.org/markdown-guide/][title](http://)Ctrl/⌘ + KInline\nCode`code`Ctrl/⌘ + Shift + KImage![alt](http://)Ctrl/⌘ + Shift + IList* itemCtrl\n+ LOrdered List1. itemCtrl/⌘ + Alt + LBlockquote> quoteCtrl + QHighlight\n==Highlight==\nH1# HeadingH2## HeadingCtrl/⌘ + HH3\n ### HeadingCtrl/⌘ + H (x2)Uploading Images\nYou can add images to your posts in many ways:\n\n * Upload from your computer\n * Click and drag an image into the browser\n * Paste directly into the editor from your clipboard\n * Insert using a URL\n\nOnce inserted you can blend images beautifully into your content at different\nsizes and add captions wherever needed.\n\nUsing image galleries\nGhost supports image galleries for up to 9 images at a time, all of which are\nresponsively optimised and organised to look their best no matter how many\nimages you add or remove.\n\nGalleries can be inserted by using the gallery card from the dynamic menu. To\nadd images to the gallery card, drag each image into the image uploader box or\nselect multiple images from your file system.\n\nAdding custom forms\nCustom forms and can be added to your content by pasting your form embed code\ninto the editor, using an HTML card from the dynamic menu. \n\nUsing code injection\nIf you need to add any other custom scripts or embeds to your post, this can be\ndone using code injection from the post settings menu. \n\nIf you need to add custom code to your entire site, this can be done from the\ncode injections settings found in Ghost admin. Review our integrations\n[https://docs.ghost.org/integrations/]  page for more information.\n\nPublishing content\nPublishing or scheduling your content can be accessed from the top left menu in\nthe editor. \n\nPublishing a post\nTo publish a post, click on the “Publish” link located in the top right corner\nof the editor then click “Publish” to set the post live.\n\nDeleting a post\nTo delete a post, click on the post title from the content list within Ghost\nAdmin. With the Ghost Editor open, expand the post settings menu using the gear\nicon and click, “Delete Post.” \n\nOnce a post has been deleted, it cannot be recovered.\n\nScheduling a post\nTo schedule your post to publish on a future date, select “Schedule it for\nlater” from the publish menu and select a date and time in the future. \n\nIn addition to the standard publishing options, the Ghost editor's post settings\nmenu allows you to optimise your content further, by setting tags, assigning\nauthors, and customising meta and social sharing details – see the full list of \npublishing options [https://docs.ghost.org/faq/publishing-options/].","featured":false,"created_at_pretty":"02 October, 2018","published_at_pretty":"02 October, 2018","updated_at_pretty":"31 January, 2019","created_at":"2018-10-02T17:23:49.000+00:00","published_at":"2018-10-02T17:26:38.000+00:00","updated_at":"2019-01-31T09:03:27.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bb375105a8ccb00bfd27ac1","slug":"publishing-options","title":"Publishing options","excerpt":"The post settings menu within the editor allows you to fully optimise your content. This is where you can add tags, authors and turn a post into a page.","feature_image":null,"plaintext":"The post settings menu within the editor\n[https://docs.ghost.org/faq/using-the-editor/]  allows you to fully optimise\nyour content. This is where you can add tags and authors, feature a post, or\nturn a post into a page.\n\nHere are all of the available options in the post settings menu:\n\nSet a feature image\nTo set a feature image to be displayed with your post, open the post settings\nmenu by clicking the gear icon and click the “Upload post image” button to\nupload an image from your file system.\n\nTo use the Unsplash integration [https://docs.ghost.org/integrations/unsplash/] \nto select a post image, click the camera icon in the post image box and select\nan Unsplash image.\n\nCustomise the Post URL\nGhost will use the title of your post to generate a Post URL. To change the Post\nURL, click inside the Post URL field in the post settings menu and type the new\nURL. Blank spaces will automatically convert to “-” in the URL field.\n\nChange the publish date\nTo set the publish date of a post, click inside the date field within the post\nsettings menu, and use the calendar to select a date. Publish dates can be\nfuture dated or back dated.\n\nTo set the time of a published (or scheduled) post, click inside the time field,\nand enter a time in 24hr 00:00 format. If the timezone is incorrect for your\nlocation, change your publication timezone in the settings.\n\nSet a tag\nTo set a tag with your post, click inside the tag field within the post settings\nmenu and begin typing your tag. If a tag already exists, it will populate the\ndropdown below. \n\nAdd a custom excerpt\nTo include a custom excerpt with a post to be displayed across your theme, enter\nthe excerpt in the excerpt field. There is no limit on excerpt length. HTML will\nnot be rendered in the custom excerpt.\n\nSet multiple authors\nBy default, Ghost assigns post authorship to the logged in user creating the\npost. To change the author, use the author field in the post settings menu.\nMultiple authors can be assigned to a post by selecting the name of the author\nfrom the author list or typing the author name in the author field.\n\nCustomise meta data\nMeta data and social sharing card details can be customised by clicking on the\n“Meta Data,” “Twitter Card,” or “Facebook Card” options from the post settings\nmenu. Each option will allow you to customise the title and description of the\npost, as well as the image to be shared if customising social sharing cards.\n\nInject custom code\nTo include custom scripts or styles with a post, use the “Code Injection” option\nfrom the post settings menu. Custom code can be added to the header or footer of\nthe post. This feature is useful when adding additional tracking scripts to a\npost or making custom CSS changes that only apply to a single post. \n\nSet a custom template\nTo use a custom post or page template with your content, select the custom\ntemplate from the \"Template\" dropdown. \n\n> For details on creating custom templates in the Ghost theme layer, refer to our \ntutorial [https://docs.ghost.org/tutorials/custom-page-templates/].\nTurn a post into a page\nTo convert a post into a page, check the box in the post settings menu. Once\nconverted to a page, the post will no longer appear in your list of posts on\nyour homepage or elsewhere on your site and is only accessible via a direct\nlink. To add a navigation link to your page, use the design settings\n[https://docs.ghost.org/faq/design-settings/]  menu.\n\n> To create static pages using custom theme templates, check out this tutorial\n[https://docs.ghost.org/tutorials/custom-home-page/].\nSet a featured post\nTo set a post as featured, check the box next to “Feature this post” in the post\nsettings menu. When a post is featured, a class of feature will be added to the \n{{post_class}}  in the HTML code for the post. This will allow you to target the\npost differently for theme development\n[https://docs.ghost.org/api/handlebars-themes].","featured":false,"created_at_pretty":"02 October, 2018","published_at_pretty":"02 October, 2018","updated_at_pretty":"31 January, 2019","created_at":"2018-10-02T13:39:28.000+00:00","published_at":"2018-10-02T13:39:59.000+00:00","updated_at":"2019-01-31T06:21:11.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bb3687c5a8ccb00bfd27ab9","slug":"general-publication-settings","title":"General publication settings","excerpt":"Update your publication's title, description, social accounts, language and more quickly using settings menu. ","feature_image":null,"plaintext":"There are several settings within Ghost Admin that allow you to make some of the\nmost fundamental changes to your publication such as titles and descriptions,\nlanguage, icons and social accounts. Access this menu on the 'General' page from\nyour publication's admin panel. \n\nHere's an overview of the available settings:\n\nChanging the title and description\nThe publication title and description are used in your theme, meta data and\nsearch results. To change the publication title or description, go to the\n“General” settings menu in Ghost admin.\n\nSetting a timezone\nTo select a timezone for all published posts on your site, go to the “General”\nsettings in Ghost admin. This means that any scheduled posts will be published\nin this timezone.\n\nSetting a language\nTo set a publication language to be used for theme translations\n[https://docs.ghost.org/api/handlebars-themes/helpers/translate/], go to\nthe“General” settings of Ghost Admin and enter the language/locale tag to be\nused, e.g. es for Spanish, fr  for French, zh  for Chinese, ja  for Japanese. \n\nMulti-language content is supported within Ghost by configuring custom\ncollections and templates using Dynamic Routing\n[https://docs.ghost.org/concepts/routing/].\nSetting a publication icon\nA publication icon is a social icon that is used as the favicon for your site.\nIt is also used within the UI of your publication and can be set from the\n“General” settings in Ghost admin. \n\nPublication icons must be square and at least 60px x 60px.\n\nUpload a logo\nA publication logo is the primary logo for your brand and is displayed across\nyour theme. You can upload a publication logo from the “General” settings in\nGhost admin. Publication logos should be transparent and at least 600px x 72px.\n\nUpload a cover image\nA cover image is an optional large background image that can be used with your\npublication. You can upload a cover image from the“General” settings in Ghost\nadmin. \n\nThere are no specific size requirements for a publication cover image. It’s\nrecommended to use images with a minimum width of 1500px to ensure your cover\nimage looks good on most devices. \n\nIt’s advised to upload an optimised image so that it does not negatively impact\npage speed.\nConnect social accounts to your site\nEnter your Facebook and Twitter account details “General” settings of Ghost\nAdmin to enable site-wide links to your social profiles defined by your theme. \n\nMake a site private\nIf you've got a publication that you don't want the world to see yet because\nit's not ready to launch, you can hide your Ghost site behind a basic shared\npass-phrase.\n\nYou can toggle this preference on at the bottom of the General Settings in Ghost\nadmin.\n\nGhost will give you a short, randomly generated pass-phrase which you can share\nwith anyone who needs access to the site while you're working on it. While this\nsetting is enabled, all search engine optimisation features will be switched off\nto help keep your site under the radar.\n\nDo remember though, this is not  secure authentication. You shouldn't rely on\nthis feature for protecting important private data. It's just a simple, shared\npass-phrase for some very basic privacy.","featured":false,"created_at_pretty":"02 October, 2018","published_at_pretty":"02 October, 2018","updated_at_pretty":"24 October, 2018","created_at":"2018-10-02T12:45:48.000+00:00","published_at":"2018-10-02T13:08:11.000+00:00","updated_at":"2018-10-24T09:32:07.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bae5a0cf193d500bfd5b442","slug":"design-settings","title":"Design settings","excerpt":"Update your publication's navigation and themes using the accessible Design Settings menu in Ghost Admin. ","feature_image":null,"plaintext":"Adding some design touches to your Ghost publication can be done from the Admin\npage when logged in to your publication. From here you can add navigation and\nupload a custom theme. \n\nAccess the design settings menu on the 'Design' page. Here's an overview of the\nsettings: \n\nAdding navigation\nAdding a navigation menu to your publication can be implemented and edited\nquickly under the design settings menu. Each page name and it's destination URL\ncan be added to the navigation menu here. \n\nTip 💡 If you're using static content on your site such as a custom home page\n[https://docs.ghost.org/tutorials/custom-home-page/]  or other pages, then you\nmay also need to remember to add your navigation to those pages directly in\ntheir theme templates.Uploading a theme\nThis is where the magic happens! Upload customised themes for your publication\nwhich unlocks the ability to render your site in almost any way imaginable. \n\nA new Ghost publication will be installed with its default theme, Casper. This\nis a beautiful magazine style theme - and since it's open source, you can use\nthis theme as a base or a starting point if you like. Otherwise, you can build a\nnew Handlebars theme from scratch. Read more about Ghost themes\n[https://docs.ghost.org/api/handlebars-themes/]!\n\nTo upload a theme to your publication, go the “Design” settings in Ghost admin\nand click the “Upload a theme” button. Once uploaded, click “Activate” to\nactivate the theme on the site.\n\nThemes should always be in .zip  format.\n\nDownload a theme\nTo download a copy of your theme as a backup or for any other purpose, click\n“Download” next to the theme from the themes list. Themes are downloaded in .zip \n format.\n\nDelete a theme\nTo delete a theme from your publication that is no longer needed, click “Delete”\nnext to the theme on the themes list.","featured":false,"created_at_pretty":"28 September, 2018","published_at_pretty":"28 September, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-09-28T16:42:52.000+00:00","published_at":"2018-09-28T16:44:00.000+00:00","updated_at":"2018-10-23T08:32:29.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bae21eaf193d500bfd5b43a","slug":"managing-your-team","title":"Managing your team in Ghost","excerpt":"Collaborate effectively on your Ghost publication with teams and user roles.","feature_image":null,"plaintext":"Ghost has a number of different user roles for your team:\n\nUser Roles\nContributors\nThis is the base user level in Ghost. Contributors can create and edit their own\ndraft posts, but they are unable to edit drafts of others or publish posts.\nContributors are untrusted  users with the most basic access to your\npublication.\n\nAuthors\nAuthors are the 2nd user level in Ghost. Authors can write, edit  and publish\ntheir own posts. Authors are trusted  users. If you don't trust users to be\nallowed to publish their own posts, they should be set as Contributors.\n\nEditors\nEditors are the 3rd user level in Ghost. Editors can do everything that an\nAuthor can do, but they can also edit and publish the posts of others - as well\nas their own. Editors can also invite new Contributors+Authors to the site.\n\nAdministrators\nThe top user level in Ghost is Administrator. Again, administrators can do\neverything that Authors and Editors can do, but they can also edit all site\nsettings and data, not just content. Additionally, administrators have full\naccess to invite, manage or remove any other user of the site.\n\nThe Owner\nThere is only ever one owner of a Ghost site. The owner is a special user which\nhas all the same permissions as an Administrator, but with two exceptions: The\nOwner can never be deleted. And in some circumstances the owner will have access\nto additional special settings if applicable. For example: billing details, if\nusing Ghost(Pro) [https://ghost.org/pricing/].\n\nIt's a good idea to ask all of your users to fill out their user profiles,\nincluding bio and social links. These will populate rich structured data for\nposts and generally create more opportunities for themes to fully populate their\ndesign.User Role Capabilities\nCapabilityAdministratorEditorAuthorContributorNon-AuthOverall User Interfaceview\n‘Settings’ in admin menuXXview ‘Your Profile’ in user menuXXX Xedit ‘Your\nProfile’ in user menuXXX XSettingsview general blog settingsXedit general blog\nsettingsXview users settingsXXUsersinvite usersXA*revoke invites to usersXA*view\nother usersXA*edit other usersXA*delete other usersXA*browseXXXadd adminXadd\neditorXadd authorXXadd contributorXXRoles UsersassignXX (role = author)viewXXXX\nbrowseXXXXTagsedit tagsXXadd tagsXXXdelete tagsXXContent Listbrowse all postsXX\nbrowse own postsXXXPostscreate new postsXXX Xpublish postsXXXedit own postsXXX\nedit other’s postsXXdelete own postsXXXdelete other’s postsXXSlugsgenerateXXX\nDatabaseimport contentXexport contentXdelete all contentXbrowseXaddXdeleteXMail\nSendXSend test mailXNotificationsX – Yes\nA* – Authors onlyOwner Special Rules\n * There can only ever be one owner\n * Owners cannot be deleted or have their role downgraded\n * Owners have a single additional capability, to transfer their ownership to\n   another user. If this is done, the owner becomes an administrator.\n\nHow to add a user\nTo add a user to your publication, go to the “Team” settings in Ghost admin and\nclick the “Invite People” button. Type in the email address of your team member,\nselect a user role and click “Send.”\n\nTo cancel an invitation, click the “revoke” link next to the user under the\ninvited user list in the “Team” settings of Ghost admin.\n\nHow to delete a user\nTo delete a user, click on the gear icon from the user’s profile in the “Team”\nsettings of Ghost Admin and select “Delete User.”\n\nDeleting a user is irreversible will delete all data (including post content)\nassociated with the user. \n\nTransfer Ownership\nTo transfer ownership of a publication, log into the site as the existing owner\nand go to the “Team” settings. Click on the user from the team list to be made\nthe new owner. From the user profile, click the gear icon in the top right\ncorner and select, “Make owner.” The exiting owner user will be downgraded to\nthe administrator role.\n\nOnly an administrator can be made a publication owner.","featured":false,"created_at_pretty":"28 September, 2018","published_at_pretty":"28 September, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-09-28T12:43:22.000+00:00","published_at":"2018-09-28T12:47:27.000+00:00","updated_at":"2018-10-23T08:33:02.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bad642ef193d500bfd5b436","slug":"the-importer","title":"Imports and exports","excerpt":"Ghost gives you full ownership of your content with sensible JSON exports available at any time. ","feature_image":null,"plaintext":"Publishing with Ghost gives you full ownership and access to your content and\ndata, with sensible JSON exports available at any time. To generate a backup, or\nmigrate content into your publication you can use the Import/Export tool found\nin the “Labs” settings in Ghost Admin.\n\nTo find out more about migrating to Ghost from other platforms, read the \nmigration documentation [https://docs.ghost.org/api/migration/].\n\nExports in Ghost\nWhen you hit the export button from the settings in your Ghost publication, your\nposts and settings will be downloaded in a single JSON file. The following\ncontent and data will be exported:\n\n * All Settings\n * Users\n * Subscribers\n * Posts\n * Pages\n * Tags\n\nThe following content won't be exported  and should be backed up individually:\n\n * Theme files\n * Images\n\nYour theme files can be downloaded into a single .zip  file from the design\nsettings page in Ghost admin. If you're self-hosting all user-provided data such\nas images and themes exist in the /content/  folder.\n\nIf you're a Ghost(Pro)  customer and would like a publication image directory,\nemail support@ghost.org  and we will provide this for you. \n\nImports in Ghost\nTo import an existing JSON file into Ghost, use the “Import” button found in the\n“Labs” settings in Ghost Admin. Imports must be a valid JSON file in order to\nwork.","featured":false,"created_at_pretty":"27 September, 2018","published_at_pretty":"27 September, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-09-27T23:13:50.000+00:00","published_at":"2018-09-27T23:24:33.000+00:00","updated_at":"2018-10-23T08:33:36.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bad07f1f193d500bfd5b40c","slug":"publication-language","title":"How do I set a publication language?","excerpt":"Find out how to set a publication language and work with multi-language content in Ghost.","feature_image":null,"plaintext":"Ghost's front-end and themes are fully translatable and the customisable dynamic\nrouting layer unlocks multi-language content. \n\nTheme translations \nTo set a publication language to be used for theme translations, go to\nthe“General” settings of Ghost Admin and enter the language/locale tag to be\nused, e.g. es  for Spanish, fr  for French, zh  for Chinese, ja  for Japanese. \n\nFor further details on how to make your theme translatable, check out the \ntranslate handlebars helper guidelines\n[https://docs.ghost.org/api/handlebars-themes/helpers/translate/].\n\nMulti-language publications\nMulti-language content is also supported by configuring custom collections and\ntemplates using Dynamic Routing. This allows you to render different languages\non their own routes - read the tutorial\n[https://docs.ghost.org/tutorials/multi-language-content]  for more details.","featured":false,"created_at_pretty":"27 September, 2018","published_at_pretty":"27 September, 2018","updated_at_pretty":"12 November, 2018","created_at":"2018-09-27T16:40:17.000+00:00","published_at":"2018-09-27T23:12:33.000+00:00","updated_at":"2018-11-12T16:11:45.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bad6330f193d500bfd5b432","slug":"forgot-password","title":"How do I reset my password?","excerpt":"If you need to reset your Ghost password, or if you have forgotten your password, use this guide!","feature_image":null,"plaintext":"In Ghost, each publication user has their own account details and password which\ncan be reset or changed.\n\nChanging your password\nThe password for each user can be changed at the bottom of your user profile\npage, which is in the 'Team' settings menu in Ghost Admin:\n\nForgot password?\nIf you forget your user account password, go to your publication sign-in page,\ne.g. yourdomain.com/ghost, enter your email address and click \"Forgot?\". Check\nyour email to reset your password and regain access to your user account. \n\nAre you the account owner?\nAccount owners have two sets of login details. One to access Ghost admin, and\none to access my.ghost.org [https://my.ghost.org]where you can manage your\npublication, billing and account information.\n\nTo change your my.ghost.org password, login in and go to the 'Account' page.\n\nIf you have forgotten your account owner login details, go to my.ghost.org\n[https://my.ghost.org], enter your email and click \"Forgot?\". Check your email\nto reset your password and regain access to your owner account.","featured":false,"created_at_pretty":"27 September, 2018","published_at_pretty":"27 September, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-09-27T23:09:36.000+00:00","published_at":"2018-09-27T23:11:27.000+00:00","updated_at":"2018-10-23T08:34:20.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bad62f3f193d500bfd5b42e","slug":"change-author-profile-picture","title":"How do I change my author profile picture?","excerpt":"Ghost uses Gravatar to set a default author profile picture, or you can upload your own. ","feature_image":null,"plaintext":"If one is available, Ghost automatically uses the gravatar\n[https://gravatar.com/]  picture tied to your email address as the author\nprofile image. This is used across your publication’s theme by default. \n\nTo use a different image, go to your user profile from the “Team” settings page\nof Ghost Admin and click on the current profile picture to upload a new image.","featured":false,"created_at_pretty":"27 September, 2018","published_at_pretty":"27 September, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-09-27T23:08:35.000+00:00","published_at":"2018-09-27T23:08:59.000+00:00","updated_at":"2018-10-23T08:34:36.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bad072af193d500bfd5b404","slug":"adding-social-accounts","title":"Can I add my social accounts?","excerpt":"Ghost integrates with your social media account in several ways, and it's possible to show social sharing links on your site with a custom theme.","feature_image":null,"plaintext":"Ghost integrates with your social media accounts in several ways.\n\nConnect your social accounts to your site\nEnter your Facebook and Twitter account details “General” settings of Ghost\nAdmin to enable site-wide links to your social profiles defined by your theme.\n\nCreate custom sharing cards\nIn each post you can create custom sharing cards for Facebook and Twitter in the\npost settings menu. This enables fine-grained control of how your content\nappears when shared by others.\n\nStructured data integration\nGhost includes full structured data and rich card support for Facebook, Twitter,\nInstagram and many more — see the full list of integrations.","featured":false,"created_at_pretty":"27 September, 2018","published_at_pretty":"27 September, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-09-27T16:36:58.000+00:00","published_at":"2018-09-27T16:37:30.000+00:00","updated_at":"2018-10-23T08:34:47.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bad06d2f193d500bfd5b400","slug":"enable-subscribers-feature","title":"How does the Subscribers feature work?","excerpt":"A subscribers feature enables you to collect email addresses from your readers and setup an integration with an email client of your choice. ","feature_image":null,"plaintext":"The Subscribers feature in Ghost allows you to capture  email addresses of\npeople who would like to subscribe to your publication's content. Email\naddresses can be viewed and edited from Ghost admin, but no emails will be sent\nwithout further integrations [https://docs.ghost.org/integrations]  with an\nemail tool.\n\nEnabling subscribers \nThis feature can be enabled in the \"Labs\" settings menu in Ghost admin. When it\nis enabled, a subscribe button will appear on your site, if your theme supports\nit. \n\nThe subscribe button appears on the far right using the Casper theme!Managing\nsubscribers\nWhen the Subscribers feature is enabled, a “Subscribers” menu item will appear\nwithin Ghost Admin:\n\nThis menu allows you to manage your subscriber list with the following actions:\n\n * Adding subscribers manually\n   Click the “Add Subscriber” button to add the subscriber email address.\n * Deleting subscribers\n   Hover over the subscriber email address and click on the trashcan icon. \n * Import a subscriber list\n   Use the “Import CSV” and “Export CSV” buttons. Imports must be in CSV format,\n   e.g. email, email@email.com, email2@email.com.\n\nIntegrations\nFrom here, you can integrate your Ghost publication with your favourite email\nclient such as Mailchimp [https://docs.ghost.org/integrations/mailchimp/]  or \nActiveCampaign [https://docs.ghost.org/integrations/activecampaign/]. \n\nFor example, you can automatically pass the subscriber list to a dedicated email\ntool using Zapier, and then set up automated emails or campaigns for your\nsubscribers.","featured":false,"created_at_pretty":"27 September, 2018","published_at_pretty":"27 September, 2018","updated_at_pretty":"12 November, 2018","created_at":"2018-09-27T16:35:30.000+00:00","published_at":"2018-09-27T16:36:29.000+00:00","updated_at":"2018-11-12T16:10:36.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5bad05f9f193d500bfd5b3f8","slug":"transfer-publication-ownership","title":"How do I transfer ownership of my publication to another user on my team?","excerpt":"Transfer the ownership of your publication to another user using the team management menu in Ghost admin.","feature_image":null,"plaintext":"To transfer ownership of a publication, log into the site as the existing owner\nand go to the “Team” settings. Click on the user from the team list to be made\nthe new owner. From their user profile, click the gear icon in the top right\ncorner and select, “Make owner.”\n\nOnly an administrator can be made a publication owner.","featured":false,"created_at_pretty":"27 September, 2018","published_at_pretty":"27 September, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-09-27T16:31:53.000+00:00","published_at":"2018-09-27T16:32:23.000+00:00","updated_at":"2018-10-23T08:36:54.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}},{"node":{"id":"Ghost__Post__5b890ec82ffffa00bfa11460","slug":"views-and-staff-users","title":"How are “views” and “staff users” calculated - Ghost(Pro) Plans","excerpt":"Views and staff users are used to determine your Ghost(Pro) plan and pricing. Read more to find out what your plan includes. ","feature_image":null,"plaintext":"Ghost(Pro) plans are determined using two metrics: views and staff users. Find\nall of the current plans on the pricing page [https://ghost.org/pricing/]. \n\nViews\nThis refers to the number of requests to your site each month, tracked much like\nan analytics 'pageview'. \n\nYour site will never be disabled if your traffic spikes. Instead, if you exceed\nyour limit consistently over a 3 month rolling average, we'll let you know that\nyou need to upgrade. \n\nStaff Users\nStaff users are the total number of users invited to your team in Ghost Admin. \n\nOnly users who have logged in at least once in the last 30 days are counted for\nbilling purposes.\n\nIf you exceed the number of total users for your plan, we will inform you by\nemail to let you know that it's time to upgrade, or remove some users from the\nTeam section within Ghost admin.","featured":false,"created_at_pretty":"31 August, 2018","published_at_pretty":"31 August, 2018","updated_at_pretty":"23 October, 2018","created_at":"2018-08-31T09:47:52.000+00:00","published_at":"2018-08-31T09:56:09.000+00:00","updated_at":"2018-10-23T08:37:11.000+00:00","tags":[{"name":"Using Ghost","slug":"using-ghost","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Sarah Frantz","slug":"sarah"}]}}]}},"pageContext":{"tagSlug":"using-ghost","tagName":"Using Ghost","tagURL":"/faq/using-ghost/","tagDescription":"Guides, hints and tips for making the most out of the open source Ghost publishing platform.","tagImage":null,"tagMetaTitle":"Using Ghost","tagMetaDescription":"Guides, hints and tips for making the most out of the open source Ghost publishing platform.","section":"faq"}}