{"data":{"site":{"siteMetadata":{"siteUrl":"https://docs.vwa.la","title":"vwa.la help","description":"Everything you need to know about the vwa.la influencer marketing platform."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5ba3f01b06626b00bf60669c","slug":"google-amp","title":"Google AMP","excerpt":"Ghost has a Google AMP integration built-in by default, which can be customised or disabled completely depending on your requirements!","feature_image":"https://docs.ghost.io/content/images/2018/09/amp.jpg","plaintext":"Ghost comes with a built-in integration for Google AMP which transforms all of\nthe content on your site into a lightening-fast AMP version ⚡\n\nThe open source AMP project is led by Google, and provides a way for publishers\nto generate lightweight versions of their content for a faster and smoother user\nexperience. \n\nIn Ghost, the AMP integration utilises the AMP framework inside a single\nHandlebars template: amp.hbs. This template transforms each post on your site\ninto an AMP version which can be accessed by adding /amp  to the end of any URL.\n \n\nHere's an AMP page demo [https://demo.ghost.io/welcome/amp/]Enabling AMP in\nGhost\nThe AMP integration in Ghost is enabled by default, but if you prefer not to use\nthe feature then you can turn it off in the settings within Ghost Admin. When\nenabled, all posts on your publication will automatically have an AMP page, with\na canonical link to ensure the page is correctly identified by the search\nengines and no duplicate content issues are found. \n\nCustomise the template with your own styles\nAMP in Ghost can be styled to suit your brand and theme too! Since the Ghost\ntheme layer is entirely customisable, that means you can also customise the way\nyour AMP pages are rendered. \n\nSo if you would like to add some styling, branding or even monetise your AMP\npages with advertisements, then you can with a few lines of code in a single\nHandlebars template. \n\nRead more about customising your AMP pages in Ghost in this handy tutorial\n[https://docs.ghost.org/tutorials/custom-amp-themes/].\n\nValidate your template in the console\nThere is an effective way to validate your AMP pages as you go directly in the\nconsole by adding #development=1  to any AMP URL. \n\nThis is a useful way to ensure any customisations you make to your AMP template\nare valid and your AMP content is rendering correctly.","featured":false,"created_at_pretty":"20 September, 2018","published_at_pretty":"16 August, 2018","updated_at_pretty":"19 November, 2018","created_at":"2018-09-20T19:08:11.000+00:00","published_at":"2018-08-16T19:08:00.000+00:00","updated_at":"2018-11-19T10:39:56.000+00:00","tags":[{"name":"Marketing","slug":"marketing","visibility":"public"},{"name":"Content","slug":"content","visibility":"public"},{"name":"SEO","slug":"seo","visibility":"public"},{"name":"#integration","slug":"hash-integration","visibility":"internal"}],"authors":[{"name":"Kym Ellis","slug":"kym"}]}},{"node":{"id":"Ghost__Post__5ba3de8406626b00bf606639","slug":"campaign-monitor","title":"Campaign Monitor","excerpt":"Integrate Ghost with Campaign Monitor and improve your email campaigns - keep\nall of your subscribers in sync and automate RSS driven emails\n\nIf you're using Campaign Monitor to power your email campaigns, you can\nintegrate this with Ghost with a few steps to sync your subscribers, embed\ncustom email subscription forms or generate RSS driven emails from your content\non Ghost.\n\nLet's take a look at some of the most popular ways you can use Ghost with\nCampaign Monitor: \n\nSync Ghost subscribers to ","feature_image":"https://docs.ghost.io/content/images/2018/09/campaign-monitor.png","plaintext":"Integrate Ghost with Campaign Monitor and improve your email campaigns - keep\nall of your subscribers in sync and automate RSS driven emails\n\nIf you're using Campaign Monitor to power your email campaigns, you can\nintegrate this with Ghost with a few steps to sync your subscribers, embed\ncustom email subscription forms or generate RSS driven emails from your content\non Ghost.\n\nLet's take a look at some of the most popular ways you can use Ghost with\nCampaign Monitor: \n\nSync Ghost subscribers to Campaign Monitor\nGhost has a built-in subscribers feature\n[https://docs.ghost.org/faq/enable-subscribers-feature/]  which can be linked to\nyour Campaign Monitor account efficiently using Zapier [https://zapier.com/].\nYou can send your subscribers in Ghost to Campaign Monitor, or vice versa. Setup\nan automation to keep your email lists fully automated and in sync.\n\nOnce this integration is setup it'll run in the background so you don't have to\nworry about a thing. \n\nEmbed custom email subscription forms\nIf you prefer to use Campaign Monitor's own subscribe forms directly, that works\ntoo! Once you have navigated to the correct email list in your Campaign Monitor\naccount and created a new signup form, grab the embed code to use on your Ghost\nsite: \n\nAs you can see in the preview, Campaign Monitor forms\n[https://help.campaignmonitor.com/html-subscribe-forms/]  are HTML and\nJavaScript, without any styling. It's possible to edit the HTML of the form to\nadd, remove or reorder the fields, and to add your own styling. You can also\nupdate the CSS in your theme files to add custom styling for your forms. \n\n\n--------------------------------------------------------------------------------\n\nAdd the form to a single post\nIf you just want to add the signup form to one particular post or page on your\nsite - you can add a new HTML block within the Ghost editor and paste the embed\ncode there. \n\n\n--------------------------------------------------------------------------------\n\nAdd the form to multiple pages of your site\nOn the other hand, if you'd like to add a newsletter signup form to multiple\npages of your site - then you'll need to add the embed code to your Ghost theme.\n\nLocate the template file where you want to insert the signup form. This is\nusually post.hbs. In Casper, Ghost's default theme, you'll see a line of code\nspecifically reserved for inserting comments. This also makes a great place for\ndropping in a newsletter signup form, so you can paste the code here, too.\n\nMake sure you remove the comments on line 65 and 69After editing you'll need to\nsave the file, upload a fresh copy of your theme, and (if you're self-hosting)\nrestart Ghost. The form should then be visible on every post!\n\n\n--------------------------------------------------------------------------------\n\nEmbed a subscribe button\nCampaign Monitor also has an option to embed a subscribe button, which opens a\npopup modal for readers to enter their information.\n\nIf you'd like to use this instead of the HTML form above, you can apply the same\nlogic and use the code provided to add it to an individual post or page, or\ninsert it in your theme's template files. \n\nSetup an RSS to Email campaign\nIt's also possible to automate RSS driven email campaigns to your subscribers,\nwhich sends the latest content on Ghost directly to your email list.\n\nCreate a new Automation in your Campaign Monitor account and use the \"Set up an\nRSS Campaign\" feature to get started. Enter the URL of the RSS feed which you'd\nlike to use to populate your newsletter content. Don't forget: You can add /rss/ \n to most URLs in Ghost to get a custom RSS feed. Here are some demo examples:\n\n * Main post index  - https://demo.ghost.io/rss/\n * Author archive  - https://demo.ghost.io/author/lewis/rss/\n * Tag archive  - https://demo.ghost.io/tag/fiction/rss/\n\nCampaign Monitor will automatically read your RSS feed and provide you with\noptions to personalise and schedule your automated campaign!\n\nDo more with Zapier automation\nIt's possible to connect Campaign Monitor to many more of your favourite tools\nand align all of your processes using Zapier - with lots of commonly used Zaps\nalready pre-built. If you can't find what you're looking for, you can build your\nown in minutes:","featured":false,"created_at_pretty":"20 September, 2018","published_at_pretty":"20 September, 2018","updated_at_pretty":"11 November, 2018","created_at":"2018-09-20T17:53:08.000+00:00","published_at":"2018-09-20T17:53:13.000+00:00","updated_at":"2018-11-11T09:53:04.000+00:00","tags":[{"name":"Email","slug":"email","visibility":"public"},{"name":"Marketing","slug":"marketing","visibility":"public"},{"name":"#integration","slug":"hash-integration","visibility":"internal"}],"authors":[{"name":"Kym Ellis","slug":"kym"}]}},{"node":{"id":"Ghost__Post__5ba3de9806626b00bf60663c","slug":"activecampaign","title":"ActiveCampaign","excerpt":"Integrate your Ghost site with ActiveCampaign to sync your subscribers or embed custom subscription forms.","feature_image":"https://docs.ghost.io/content/images/2018/09/activecampaign.png","plaintext":"Integrate Ghost with ActiveCampaign to sync your subscribers and embed custom\nsubscription forms to grow your email list.\n\nWhether you're using ActiveCampaign to send one-off email campaigns to your\nreaders once a week, or you're running fully automated email marketing funnels -\nensure your Ghost publication is fully integrated and your subscribers are in\nsync.\n\nHere are some different ways you can use Ghost and ActiveCampaign together:\n\nSync Ghost subscribers to ActiveCampaign\nIf you're collecting your visitors email addresses using the built-in \nsubscribers feature [https://docs.ghost.org/faq/enable-subscribers-feature/]  in\nGhost, it's possible to link this with your ActiveCampaign account using Zapier\nto ensure subscribers in Ghost are always pushed into ActiveCampaign, or vice\nversa.\n\nThis saves lots of time updating email lists, and ensures your list is fully\nsynchronised between the two different systems.\n\nOnce this integration has been setup it'll run in the background and make sure\nthat your subscriber lists are always up to date.\n\n\n--------------------------------------------------------------------------------\n\nEmbed an email subscription form\nIf you'd rather use ActiveCampaign's own forms directly, that's fine too! You\ncan use any  of form, bar, box or modal code provided by ActiveCampaign within\nGhost.\n\nFirst you'll need to create a new signup form  for your ActiveCampaign list.\nselect the options you'd like to use, and copy the code provided. You can use\neither the Simple Embed  or the Full Embed  - they both do the same thing, but\nthe Full Embed allows you to customise the code if you want to.\n\n\n--------------------------------------------------------------------------------\n\nAdd the form to a single post\nIf you just want to add the signup form to one particular post or page on your\nsite - you can add a new HTML block within the Ghost editor and paste the embed\ncode there. Hit publish. And you're all set.\n\n\n--------------------------------------------------------------------------------\n\nAdd the form to multiple pages of your site\nOn the other hand, if you'd like to add a newsletter signup form to multiple\npages of your site - then you'll need to add the embed code to your Ghost theme.\n\nLocate the template file where you want to insert the signup form; usually \npost.hbs  - right after the content. In Casper, Ghost's default theme, you'll\nsee a line of code specifically reserved for inserting comments. This also makes\na great place for dropping in a newsletter signup form, so you can paste the\ncode here, too.\n\nMake sure you remove the comments on line 65 and 69After editing you'll need to\nsave the file, upload a fresh copy of your theme, and (if you're self-hosting)\nrestart Ghost. The form should then be visible on every post!\n\n\n--------------------------------------------------------------------------------\n\nSetup an RSS to Email campaign\nIt's also possible to use the ActiveCampaign RSS-to-Email\n[https://help.activecampaign.com/hc/en-us/articles/206641310-RSS-and-email-marketing] \n feature to generate automated newsletters of your latest content on Ghost,\ndirectly to your subscribers! To do this, create a new RSS Triggered  campaign:\n\nOnce you've selected the list options you'd  like to use and you reach the\ndesign stage, insert an RSS Feed  block into your newsletter template:\n\nThen select the RSS feed you'd like to use in your newsletter. Don't forget: You\ncan add /rss/  to most URLs in Ghost to get a custom RSS feed. Here are some\ndemo examples:\n\n * Main post index  - https://demo.ghost.io/rss/\n * Author archive  - https://demo.ghost.io/author/lewis/rss/\n * Tag archive  - https://demo.ghost.io/tag/fiction/rss/\n\nOnce everything is configured you'll see your RSS feed appearing within your\nnewsletter template. From here you can finish up your design, and set the\nschedule for how often you'd like your campaign to check the RSS feed for new\nitems and send to your subscribers.\n\n\n--------------------------------------------------------------------------------\n\nDo more with Zapier automation\nYou can connect ActiveCampaign to more of your favourite tools using Zapier,\nwith lots of commonly used Zaps already pre-built. Here are some examples!","featured":false,"created_at_pretty":"20 September, 2018","published_at_pretty":"20 September, 2018","updated_at_pretty":"02 November, 2018","created_at":"2018-09-20T17:53:28.000+00:00","published_at":"2018-09-20T17:53:34.000+00:00","updated_at":"2018-11-02T08:07:23.000+00:00","tags":[{"name":"Email","slug":"email","visibility":"public"},{"name":"Marketing","slug":"marketing","visibility":"public"},{"name":"#integration","slug":"hash-integration","visibility":"internal"}],"authors":[{"name":"Kym Ellis","slug":"kym"}]}},{"node":{"id":"Ghost__Post__5ba3f52a06626b00bf6066b7","slug":"hubspot","title":"Hubspot","excerpt":"Integrate Ghost with Hubspot for more efficient email campaigns - keep your\nsubscribers in sync and automate RSS to email\n\nIf you're using the Hubspot marketing software to run your email campaigns,\nensure your Ghost publication is fully integrated and all of your subscribers\nare in sync.\n\nHere are some popular ways you can use Ghost and Hubspot together:\n\nSync Ghost subscribers to Hubspot\nGhost comes with a built-in subscribers feature\n[https://docs.ghost.org/faq/enable-subscribers-feature/]  t","feature_image":"https://docs.ghost.io/content/images/2018/09/hubspot.png","plaintext":"Integrate Ghost with Hubspot for more efficient email campaigns - keep your\nsubscribers in sync and automate RSS to email\n\nIf you're using the Hubspot marketing software to run your email campaigns,\nensure your Ghost publication is fully integrated and all of your subscribers\nare in sync.\n\nHere are some popular ways you can use Ghost and Hubspot together:\n\nSync Ghost subscribers to Hubspot\nGhost comes with a built-in subscribers feature\n[https://docs.ghost.org/faq/enable-subscribers-feature/]  that allows you to\ncollect reader email addresses and it's entirely possible to link this with your\nHubspot account using Zapier. This will ensure subscribers in Ghost are always\npushed into Hubspot or vice versa, saving you from the task of manual updates.\n\nOnce your integration has been setup it'll run in the background and make sure\nthat your subscriber lists are always up to date.\n\nEmbed custom subscription forms\nIf you prefer to use subscriber forms\n[https://knowledge.hubspot.com/articles/kcs_article/forms/create-forms]  from\nHubspot directly - you can use their form builder tool to create a form and\nembed this in Ghost using HTML cards or directly in your site's theme files.\n\nFirst you'll need to create a new signup form  from your Hubspot account list\nand customise it as necessary:\n\nOnce you have personalised the design and behaviour for your form, use the embed\ncode to integrate the form with your Ghost site: \n\n\n--------------------------------------------------------------------------------\n\nAdd the form to a single post\nIf you just want to add the signup form to one particular post or page on your\nsite - you can add a new HTML block within the Ghost editor and paste the HTML\nembed code there. Hit publish. And you're all set.\n\n\n--------------------------------------------------------------------------------\n\nAdd the form to multiple pages of your site\nIf you'd like to add a newsletter signup form to multiple pages of your site,\nthen you'll need to add the embed code to your Ghost theme.\n\nLocate the template file where you want to insert the signup form. This is\nusually post.hbs.  Ghost's default theme Casper  has a spot specifically\nreserved for inserting comments in here, which is an ideal location for an email\nsubscriber form, right after the content:\n\nMake sure you remove the comments on line 65 and 69After editing you'll need to\nsave the file and upload a fresh copy of your them. Don't forget to restart\nGhost if you're self-hosting!\n\nSetup an automated RSS email campaign\nIt's also possible to use RSS feeds to setup automatically generated campaigns\nof the latest content on Ghost, directly to your subscribers!\n\nIn Hubspot your subscribers are able to manage their own subscriptions and\ndecide which emails to receive, so you'll need to create a custom property\n[https://knowledge.hubspot.com/articles/kcs_article/cos-blog/set-up-an-rss-to-email-blog-subscription-for-an-external-blog] \n and an active subscription form tied to an email list specifically for your RSS\nemail campaign. \n\nOnce this is complete, you can build a new email using a URL to automate the\npopulation of your content from Ghost. Don't forget: You can add /rss/  to most\nURLs in Ghost to get a custom RSS feed. Here are some demo examples:\n\n * Main post index  - https://demo.ghost.io/rss/\n * Author archive  - https://demo.ghost.io/author/lewis/rss/\n * Tag archive  - https://demo.ghost.io/tag/fiction/rss/\n\nOnce you've customised your email in the editor, you can schedule the email as a\none-off or a recurring newsletter of your latest content. \n\nDo more with Zapier automation\nConnect Hubspot to more of your favourite tools and align all of your processes.\nZapier has lots more commonly used automations already pre-built - or you can\nbuild your own.","featured":false,"created_at_pretty":"20 September, 2018","published_at_pretty":"20 September, 2018","updated_at_pretty":"13 November, 2018","created_at":"2018-09-20T19:29:46.000+00:00","published_at":"2018-09-20T19:29:58.000+00:00","updated_at":"2018-11-13T12:01:30.000+00:00","tags":[{"name":"Marketing","slug":"marketing","visibility":"public"},{"name":"#integration","slug":"hash-integration","visibility":"internal"}],"authors":[{"name":"Kym Ellis","slug":"kym"}]}},{"node":{"id":"Ghost__Post__5ba3fd2306626b00bf6066d8","slug":"revue","title":"Revue","excerpt":"Integrate Ghost with Revue to automate keeping your subscribers in sync and\nensure all of your subscribers receive your latest email campaigns\n\nIf you're using Revue to curate and send your editorial newsletters, you can\nfully automate an integration with Ghost to ensure your subscribers are in sync.\n\nSync Ghost subscribers to Revue\nIf you're using the built-in subscribers feature\n[https://docs.ghost.org/faq/enable-subscribers-feature/]  in Ghost to collect\nyour readers email addresses and also ","feature_image":"https://docs.ghost.io/content/images/2018/09/revue.svg","plaintext":"Integrate Ghost with Revue to automate keeping your subscribers in sync and\nensure all of your subscribers receive your latest email campaigns\n\nIf you're using Revue to curate and send your editorial newsletters, you can\nfully automate an integration with Ghost to ensure your subscribers are in sync.\n\nSync Ghost subscribers to Revue\nIf you're using the built-in subscribers feature\n[https://docs.ghost.org/faq/enable-subscribers-feature/]  in Ghost to collect\nyour readers email addresses and also using Revue to send campaigns, you can\nensure that the two are continuously in sync using Zapier. \n\nSetting up an automation will ensure subscribers in Ghost are always pushed into\nRevue, or vice versa, saving you tons of time in manual updates.\n\nOnce this integration has been setup it'll run in the background and make sure\nthat your subscriber lists are always up to date.\n\nDo more with Zapier\nPower up your site even further using Zapier [https://zapier.com/]! If you're\nalready using Revue for email campaigns, then you might also like some of these\ncomplimentary automations:","featured":false,"created_at_pretty":"20 September, 2018","published_at_pretty":"20 September, 2018","updated_at_pretty":"12 November, 2018","created_at":"2018-09-20T20:03:47.000+00:00","published_at":"2018-09-20T20:04:05.000+00:00","updated_at":"2018-11-12T07:25:44.000+00:00","tags":[{"name":"Marketing","slug":"marketing","visibility":"public"},{"name":"#integration","slug":"hash-integration","visibility":"internal"}],"authors":[{"name":"Kym Ellis","slug":"kym"}]}},{"node":{"id":"Ghost__Post__5ba3feb306626b00bf6066dc","slug":"drip","title":"Drip","excerpt":"Give your email campaigns a boost and integrate Ghost with Drip – sync\nsubscribers and deliver email campaigns efficiently\n\nThe most popular ways to integrate Drip with Ghost are to sync your email\nsubscribers, embedding custom email subscription or signup forms and creating an\nRSS driven newsletter.\n\nLet's take a look at a few of the different ways you can use Ghost with Drip to\nautomate and improve your email campaigns: \n\nSync Ghost subscribers with Drip\nWhen collecting reader email addresses ","feature_image":"https://docs.ghost.io/content/images/2018/09/drip-brandmark-black.png","plaintext":"Give your email campaigns a boost and integrate Ghost with Drip – sync\nsubscribers and deliver email campaigns efficiently\n\nThe most popular ways to integrate Drip with Ghost are to sync your email\nsubscribers, embedding custom email subscription or signup forms and creating an\nRSS driven newsletter.\n\nLet's take a look at a few of the different ways you can use Ghost with Drip to\nautomate and improve your email campaigns: \n\nSync Ghost subscribers with Drip\nWhen collecting reader email addresses using the built-in subscribers feature\n[https://docs.ghost.org/faq/enable-subscribers-feature/]  in Ghost, it's\npossible to sync these email addresses with your Drip account using Zapier\n[https://zapier.com/]. This ensures subscribers in Ghost are always pushed to\nDrip or vice versa and keeps everything in sync, saving you the time of doing\nmanual updates.\n\nOnce this integration has been setup it'll run in the background and make sure\nthat your subscriber lists are always up to date.\n\nEmbed Drip email subscription forms\nIf you prefer to use Drip's own subscriber forms directly, it's possible to use\nany of the form builders, widgets or other embed options within Ghost. They can\nall be enabled or embedded efficiently using code injection or HTML cards in the\neditor. \n\nFirst you'll need to create a new signup form  in your Drip account:\n\nEach form you create has a unique reference name and can be configured\nindividually, with the option to use the embed code to inject raw un-styled\nforms in HTML, or the widget popup forms across your site.\n\n\n--------------------------------------------------------------------------------\n\nEmbed an HTML form on a single post\nTo use HTML embedded forms, locate the embed code from within the form editor in\nyour Drip account: \n\nTo add the signup form to a particular post or page on your site, add a new HTML\nblock within the Ghost editor and paste the embed code there. \n\nOnce you hit publish, an un-styled (but functional) form will appear on your\npost or page. To add your own styling to this form, edit the CSS in your theme\nfiles and update your theme in Ghost Admin. \n\n\n--------------------------------------------------------------------------------\n\nEmbed an HTML form across multiple pages\nOn the other hand, you can also insert the form HTML into the appropriate\ntemplate files within your theme.\n\nLocate the template file where you want to insert the signup form; usually \npost.hbs  right after the content. In Casper, Ghost's default theme, you'll see\na line of code specifically reserved for inserting comments. This also makes a\ngreat place for dropping in a newsletter signup form, so you can paste the code\nhere, too.\n\nMake sure you remove the comments on line 65 and 69After editing you'll need to\nsave the file, upload a fresh copy of your theme, and (if you're self-hosting)\nrestart Ghost. The form should then be visible on every post!\n\n\n--------------------------------------------------------------------------------\n\nUse the widget form on multiple pages of your site\nIf you'd like to use the Drip widget forms on various parts of your site, go to\nyour account settings in Drip and copy and paste the Javascript snippet in the\nsite setup menu: \n\nThis snippet can be pasted into the site-wide code injection in Ghost Admin if\nyou'd like to implement the widget across your site. Additionally, Drip allows\nyou to specify which URLs the widget will appear on in the form editor for more\nfine-grained control.\n\nSetup an RSS to Email campaign\nIt's also possible to use the Drip RSS-to-Email\n[https://help.drip.com/hc/en-us/articles/115003731671-RSS-to-Email]  feature to\ngenerate automated newsletters of your latest content on Ghost, directly to your\nsubscribers!\n\nOnce you've activated the feature, wire up the RSS feed which you'd like to use\nto populate your newsletter content. Don't forget: You can add /rss/  to most\nURLs in Ghost to get a custom RSS feed. Here are some demo examples:\n\n * Main post index  - https://demo.ghost.io/rss/\n * Author archive  - https://demo.ghost.io/author/lewis/rss/\n * Tag archive  - https://demo.ghost.io/tag/fiction/rss/\n\nDo more with Zapier automation\nConnect Drip to many more of your favourite tools and align all of your\nprocesses using Zapier. Get started with lots of commonly used Zaps already\npre-built, or if you can't find what you're looking for you can build your own:","featured":false,"created_at_pretty":"20 September, 2018","published_at_pretty":"20 September, 2018","updated_at_pretty":"12 November, 2018","created_at":"2018-09-20T20:10:27.000+00:00","published_at":"2018-09-20T20:11:11.000+00:00","updated_at":"2018-11-12T10:25:49.000+00:00","tags":[{"name":"Email","slug":"email","visibility":"public"},{"name":"Marketing","slug":"marketing","visibility":"public"},{"name":"#integration","slug":"hash-integration","visibility":"internal"}],"authors":[{"name":"Kym Ellis","slug":"kym"}]}},{"node":{"id":"Ghost__Post__5ba4030106626b00bf6066f0","slug":"custom-rss","title":"Custom RSS","excerpt":"Create custom RSS feeds for your publication using the flexible dynamic routing\nlayer in Ghost and Handlebars templates\n\nAdding /rss/  to most URLs in Ghost produces an automatically generated rss \nfeed, for example: \n\n * Main post index  - https://demo.ghost.io/rss/\n * Author archive  - https://demo.ghost.io/author/lewis/rss/\n * Tag archive  - https://demo.ghost.io/tag/fiction/rss/\n\nAutomatic rss  feeds save time, and allow external applications to access an\nup-to-date feed of your content. How","feature_image":"https://docs.ghost.io/content/images/2018/09/rss.png","plaintext":"Create custom RSS feeds for your publication using the flexible dynamic routing\nlayer in Ghost and Handlebars templates\n\nAdding /rss/  to most URLs in Ghost produces an automatically generated rss \nfeed, for example: \n\n * Main post index  - https://demo.ghost.io/rss/\n * Author archive  - https://demo.ghost.io/author/lewis/rss/\n * Tag archive  - https://demo.ghost.io/tag/fiction/rss/\n\nAutomatic rss  feeds save time, and allow external applications to access an\nup-to-date feed of your content. However, when the default implementation of rss \n feeds in Ghost doesn't suit your requirements, you can create custom feeds\nusing the dynamic routing layer and a Handlebars template.\n\nHere's an example of how to create a custom rss  feed for a specific route on a\nGhost publication: \n\nAdd an rss  route in routes.yaml: \nIn order to create a custom rss  feed you'll need to add a new route, which is\nthe URL where your feed will appear.\n\nDownload the latest version of the routes.yaml  file from Ghost Admin and open\nit in any code editor:\n\nUnder routes add the URL where your new custom rss  feed will exist, for\nexample: \n\nroutes:\n  /news/rss/:\n    template: news/rss\n    content_type: rss\n\nCustom rss  feeds need to be defined with the content_type  property and mapped\nto a template as shown in the example above. \n\nCreate an new template\nThe next step is to create a custom template in your theme. Following the\nexample above, create a new template with the file name: news/rss.hbs. Here's a\ncode example of what a custom rss  template can look like: \n\n<rss xmlns:dc=\"http://purl.org/dc/elements/1.1/\" xmlns:content=\"http://purl.org/rss/1.0/modules/content/\" xmlns:atom=\"http://www.w3.org/2005/Atom\" xmlns:media=\"http://search.yahoo.com/mrss/\" version=\"2.0\">\n<channel>\n<title><![CDATA[ {{@blog.title}} ]]></title>\n<description><![CDATA[ {{@blog.description}} ]]></description>\n<link>{{@blog.url}}</link>\n<image>\n    <url>{{@blog.url}}/favicon.png</url>\n    <title>{{@blog.title}}</title>\n    <link>{{@blog.url}}</link>\n</image>\n<lastBuildDate>{{date format=\"ddd, DD MMM YYYY HH:mm:ss ZZ\"}}</lastBuildDate>\n<atom:link href=\"{{@blog.url}}\" rel=\"self\" type=\"application/rss+xml\"/>\n<ttl>60</ttl>\n\n{{#foreach \"posts\"}}\n<item>\n    <title><![CDATA[ {{title}} ]]></title>\n    <description><![CDATA[ {{excerpt}} ]]></description>\n    <link>{{url absolute=\"true\"}}</link>\n    <guid isPermaLink=\"false\">{{id}}</guid>\n    <category><![CDATA[ {{primary_tag}} ]]></category>\n    <dc:creator><![CDATA[ {{author.name}} ]]></dc:creator>\n    <pubDate>{{date format=\"ddd, DD MMM YYYY HH:mm:ss ZZ\"}}</pubDate>\n    <media:content url=\"{{feature_image}}\" medium=\"image\"/>\n    <content:encoded><![CDATA[ {{content}} ]]></content:encoded>\n</item>\n{{/foreach}}\n\n</channel>\n</rss>\n\n\nYou can copy and paste this exact implementation for your site, then go ahead\nand customise it to suit your needs!\n\nUpdate your active theme and routes.yaml\nOnce you've saved your changes, upload your updated theme in Ghost Admin as a \n.zip  file and upload your new routes.yaml  file. That's it, you've successfully\ncreated a custom RSS feed - you can test it out for yourself using the feed's\nURL!\n\nAdvanced RSS feeds for podcasting\nIf you're looking for a more detailed examples specifically for generating an\niTunes compatible podcast RSS feed, make sure you check out our in-depth\npodcast\nfeed tutorial [https://docs.ghost.org/tutorials/custom-rss-feed/]  for Ghost,\nwhich builds on the things covered here!\n\nDo more with Zapier\nAs always, you can power up your site even further using Zapier\n[https://zapier.com].  Check out some of these powerful RSS automations:","featured":false,"created_at_pretty":"20 September, 2018","published_at_pretty":"20 September, 2018","updated_at_pretty":"06 December, 2018","created_at":"2018-09-20T20:28:49.000+00:00","published_at":"2018-09-20T20:29:05.000+00:00","updated_at":"2018-12-06T10:19:34.000+00:00","tags":[{"name":"Marketing","slug":"marketing","visibility":"public"},{"name":"Utility","slug":"utility","visibility":"public"},{"name":"Automation","slug":"automation","visibility":"public"},{"name":"#integration","slug":"hash-integration","visibility":"internal"}],"authors":[{"name":"Kym Ellis","slug":"kym"}]}},{"node":{"id":"Ghost__Post__5be0041c4b8b9800bf8d3bfd","slug":"custom-integrations","title":"Custom","excerpt":"Ghost is completely open source and can be integrated with just about any other\napp or service.\n\nFront-end integrations\nBecause you have full control of the front-end of a Ghost site, just about any\napp and service with a front-end integration or clientside embed is compatible\nwith Ghost. Anything which uses HTML, CSS and JavaScript will always work - so\nif you have an embed code then chances are all you need to do is copy and paste\nit for everything to work.\n\nAPI+webhook integrations\nGhost also","feature_image":"https://docs.ghost.io/content/images/2018/11/custom.svg","plaintext":"Ghost is completely open source and can be integrated with just about any other\napp or service.\n\nFront-end integrations\nBecause you have full control of the front-end of a Ghost site, just about any\napp and service with a front-end integration or clientside embed is compatible\nwith Ghost. Anything which uses HTML, CSS and JavaScript will always work - so\nif you have an embed code then chances are all you need to do is copy and paste\nit for everything to work.\n\nAPI+webhook integrations\nGhost also supports custom API integrations which can be authenticated with\nindividual keys, and deliver outgoing webhooks based on particular events.\n\nAdd a new custom integration\nFrom the integrations screen in Ghost Admin, click on the Add custom integration \n button\n\nCopy API key\nAll custom integrations automatically come with a Content API  key which can be\ncopied as soon as the integration is created. This key will give you access to\nall content in Ghost programmatically, outside of Ghost core. Optionally, you\ncan also add an icon and description of your integration for your own reference.\n\nMore information about using Ghost's Content API can be found in the full \nContent API Documentation [https://docs.ghost.org/api/content/].\n\nSet up a webhook\nOptionally, custom integrations can also deliver outgoing webhooks based on\nevents which happen in Ghost to trigger actions elsewhere. For instance, an\nexternal notification or rebuild command. Available events to trigger webhooks\nare:\n\n * Site changed  (rebuild)\n * Subscriber added\n * Subscriber deleted\n\nMore info about Ghost webhooks can be found in the webhook documentation\n[https://docs.ghost.org/api/webhooks/].\n\nZapier integrations\nFinally, custom integrations can be easily created using Zapier to build simple\nor complex integrations, depending on your needs.\n\nCheck out the Zapier integration page\n[https://docs.ghost.org/integrations/zapier/]  for more details.","featured":false,"created_at_pretty":"05 November, 2018","published_at_pretty":"11 November, 2018","updated_at_pretty":"19 November, 2018","created_at":"2018-11-05T08:49:32.000+00:00","published_at":"2018-11-11T09:07:55.000+00:00","updated_at":"2018-11-19T09:23:25.000+00:00","tags":[{"name":"Utility","slug":"utility","visibility":"public"},{"name":"Automation","slug":"automation","visibility":"public"},{"name":"Content","slug":"content","visibility":"public"},{"name":"Marketing","slug":"marketing","visibility":"public"},{"name":"Email","slug":"email","visibility":"public"},{"name":"Analytics","slug":"analytics","visibility":"public"},{"name":"Storage","slug":"storage","visibility":"public"},{"name":"Community","slug":"community","visibility":"public"},{"name":"Surveys & Forms","slug":"surveys-forms","visibility":"public"},{"name":"SEO","slug":"seo","visibility":"public"},{"name":"#integration","slug":"hash-integration","visibility":"internal"},{"name":"Social","slug":"social","visibility":"public"}],"authors":[{"name":"John O'Nolan","slug":"john"}]}}]}},"pageContext":{"tagSlug":"marketing","tagName":"Marketing","tagURL":"/integrations/marketing/","tagDescription":null,"tagImage":null,"tagMetaTitle":null,"tagMetaDescription":null,"section":"integrations"}}