{"data":{"site":{"siteMetadata":{"siteUrl":"https://docs.vwa.la","title":"vwa.la help","description":"Everything you need to know about the vwa.la influencer marketing platform."}},"allGhostPost":{"edges":[{"node":{"id":"Ghost__Post__5c3f05a28177ee00bf712e4c","slug":"change-configured-site-url","title":"How do I change my configured site URL?","excerpt":"If you're running into issues with a misconfigured protocol or domain, you can\nupdate it easily with the ghost config\n[https://docs.ghost.org/api/ghost-cli/config/]  command.\n\nChange the configuration\nUpdate your url by issuing the ghost config  command from inside your Ghost\ndirectory:\n\nghost config url https://my-domain.com\n\n\nYou can easily find where Ghost was installed by calling the ghost ls  utility\nfrom anywhere on your server.\n\nSetup SSL\nIf you're switching to a url that contains HTTPS (","feature_image":null,"plaintext":"If you're running into issues with a misconfigured protocol or domain, you can\nupdate it easily with the ghost config\n[https://docs.ghost.org/api/ghost-cli/config/]  command.\n\nChange the configuration\nUpdate your url by issuing the ghost config  command from inside your Ghost\ndirectory:\n\nghost config url https://my-domain.com\n\n\nYou can easily find where Ghost was installed by calling the ghost ls  utility\nfrom anywhere on your server.\n\nSetup SSL\nIf you're switching to a url that contains HTTPS (recommended) then you'll need\nto make sure SSL is setup for this domain:\n\nghost setup nginx ssl\n\n\nRestart Ghost\nTo apply the changes you must restart ghost:\n\nghost restart\n\n\n\n--------------------------------------------------------------------------------\n\nThese are some common problems caused by a misconfigured URL:\n\nCanonical, RSS or Sitemap URLs are HTTP instead of HTTPS\n\nGhost uses the configured URL to generate all URLS. Make sure this URL starts\nwith https://  if you want Ghost to generate HTTPS links by default.\n\nCanonical, RSS, or Sitemap URLs contain localhost\n\nYou need to configure your domain using ghost config  as described above.\n\nScheduled posts not publishing\n\nWhen publishing a scheduled post, Ghost makes a call to the configured URL that\ncan be fail if your proxy or URL are misconfigured. Often this occurs when the\nsite is served over HTTPS but the URL is configured to HTTP. \n\nAdmin panel is incorrectly redirected\n\nMake sure your configured URL is the one you are using to access the admin\npanel. You can set a separate domain for your admin panel using ghost config\nadmin.url https://your-admin-domain.com.\n\nSetting Ghost URL to HTTPS causes an infinite redirect loop\n\nThis is a proxy configuration issue. Make sure that X-Forwarded-Proto  is being\nset to https, and that the X-Forwarded-Host  and X-Forwarded-For  headers are\nbeing set correctly by nginx or any other proxy you might be using.\n\nLinks wrong when behind reverse proxy\n\nMake sure the configured URL matches the one being used to visit your site,\nincluding the protocol and any subdirectories using ghost config  as described\nabove.\n\nMy HTTPS URL isn't working\n\nMake sure you've run ghost setup nginx ssl.\n\nI've configured my URL and Ghost isn't using it\n\nRestart Ghost to apply config changes using ghost restart.","featured":false,"created_at_pretty":"16 January, 2019","published_at_pretty":"18 January, 2019","updated_at_pretty":"18 January, 2019","created_at":"2019-01-16T10:21:22.000+00:00","published_at":"2019-01-18T15:35:27.000+00:00","updated_at":"2019-01-18T15:41:29.000+00:00","tags":[{"name":"Self-hosting","slug":"self-hosting","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Hannah Wolfe","slug":"hannah"}]}},{"node":{"id":"Ghost__Post__5bc6aa3b94250c00bf9d3c8f","slug":"clustering-sharding-multi-server","title":"Clustering, sharding and other multi-server setups","excerpt":"Ghost does not support clustering or multi-server setups of any description, there should only be one Ghost instance per site. ","feature_image":null,"plaintext":"Ghost does not support load-balanced clustering or multi-server setups of any\ndescription, there should only be one  Ghost instance per site. \n\nThe recommended scaling and performance approach is to put a cache and/or CDN in\nfront of your blog; pages generated by Ghost are essentially static so there\nshould be very little traffic hitting your Ghost server with a well configured\ncache.\n\nErrors\nIf you try to run Ghost on multiple nodes, you will run into errors such as \nResponse code 405 (Method Not Allowed)  - and find that the Ghost service needs\nto be constantly restarted for any content to reliably appear.\n\nThe correct solution is to reduce your infrastructure to a single node and use\ncaching.","featured":false,"created_at_pretty":"17 October, 2018","published_at_pretty":"17 October, 2018","updated_at_pretty":"16 January, 2019","created_at":"2018-10-17T03:19:23.000+00:00","published_at":"2018-10-17T03:28:49.000+00:00","updated_at":"2019-01-16T15:40:45.000+00:00","tags":[{"name":"Self-hosting","slug":"self-hosting","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"John O'Nolan","slug":"john"}]}},{"node":{"id":"Ghost__Post__5bc560f094250c00bf9d3bd6","slug":"upgrade-to-ghost-1-0","title":"Upgrade to Ghost 1.0","excerpt":"How to upgrade to Ghost 1.0 - a major upgrade with breaking changes and no automatic migration path. ","feature_image":null,"plaintext":"Ghost 1.0 was released in July 2017 marking the 100th release of Ghost, and the\nfirst major upgrade since the platform launched. This update includes a new\neditor, an updated UI, night shift mode and lots more new features.\n\nGhost 1.0.0 is a major upgrade, with breaking changes and no automatic migration\npath. To migrate to 1.0.0 you’ll need to handle breaking changes in the Theme\nAPI, and in the Public API if you make use of it.\n\nThis guide is useful for all self-hosted Ghost users. If you are using \nGhost(Pro) [https://ghost.org/pricing/]  then you are automatically upgraded to\nthe latest version of Ghost.Why upgrade to 1.0?\nSince Ghost 1.0 has breaking changes with no automatic migration path, all\npublications running Ghost LTS versions (0.x) must be upgraded to Ghost 1.0\nbefore they can be successfully upgraded to Ghost 2.0 and beyond.\n\nIf you’re still running an older version of Ghost, we highly recommended that\nyou upgrade to ensure you have all of the latest features, security and support.\nHere’s the current version history and end of life support\n[https://docs.ghost.org/faq/major-versions-lts/].\n\nTo upgrade from Ghost 1.x to Ghost 2.x using the ghost-cli  use the Migrating\nto\n2.0 guide [https://docs.ghost.org/faq/upgrade-to-ghost-2-0/].\n--------------------------------------------------------------------------------\n\nPrerequisites\nTo upgrade to Ghost 1.0 you must be running an LTS version of Ghost (0.x). This\nupgrade requires creating a brand new install and importing your JSON content\nexport, so it is a prerequisite to ensure you have a full backup in place before\nyou begin. Here's a breakdown of the migration steps that you’ll go through:\n\n * Prepare your theme\n * Backup your content\n * Create a new Ghost v1.0.0 install\n * Import your JSON file\n * Copy your images to your new site\n * Upload your theme\n * Update external sites using Public API\n\n\n--------------------------------------------------------------------------------\n\nPrepare your theme\nSince there are breaking changes in the theme API between Ghost LTS and 1.0,\nyour theme may need to be updated. \n\nCheck theme compatibility using gscan\nUsing the tool gscan [https://gscan.ghost.org]  is the fastest way to check your\ntheme compatibility against all current versions of Ghost. It allows you to\nupload a zip file of your current theme to check for errors, deprecations and\nother compatibility issues.\n\n 1. Download your current active theme as a .zip from the design settings page\n    in Ghost admin.\n 2. Upload this file on the gscan page [https://gscan.ghost.org]\n 3. Select 1.0.0 as the Ghost version to check your theme for this migration\n\nThe tool lists all errors and provide a full explanation and description of how\nto update your theme. All items listed as “must fix” are required to be updated\nwithin your theme for the 1.0.0 migration. Any items listed as “consider fixing”\nare recommended to ensure future upgrades are smoother. \n\n\n--------------------------------------------------------------------------------\n\nBackup your content\nWhen backing up a Ghost site, there are 2 main things that need to be done:\n\n 1. Download a JSON export from Ghost admin\n 2. Ensure you have a backup of your content folder\n\nJSON export\nRetrieve an up-to-date JSON export from the Ghost admin in the labs section,\nwhich can be accessed at yourdomain.com/ghost/settings/labs/. This downloads a\nJSON export file that you’ll need later to your machine. \n\nContent folder backup\nAll user-provided data such as images and themes exist in the /content/ folder.\nWe strongly recommend making a copy of these files. To do this run the following\ncommand on yours sever: \n\ncp -r content /tmp/content-backup\n\n\n\n--------------------------------------------------------------------------------\n\nCreate a new Ghost 1.0.0 install\nSince there is no automatic upgrade path for this version of Ghost, you'll need\nto create a clean install of Ghost 1.0.0 to production. \n\nFollow the step-by-step guide to install Ghost on your server\n[https://docs.ghost.org/install/ubuntu/]  using the Ghost CLI. When you install\nGhost, use the installation command with the version number to install the\ncorrect version of Ghost for this migration:\n\nghost install --v1\n\n\nUpon install, follow the setup questions as directed in the guide and ensure\nyour new install is configured correctly.\n\n\n--------------------------------------------------------------------------------\n\nImport your JSON file\nOnce Ghost has been reinstalled on your server, you can import your content\nusing the JSON file that you exported earlier. Import your file in the labs\nscreen under settings in Ghost admin.\n\nAll user accounts are locked on import\nThe Ghost importer does not import user passwords or tokens. All user accounts\n(except the one used to do the import) are locked on import. Use the password\nreset mechanism to regain access.\n\n\n--------------------------------------------------------------------------------\n\nCopy your images\nYour content folder backup that you created earlier now needs to be moved from\nyour existing directory <old-ghost-dir>/content/images  to the new blog\ndirectory <new-ghost-dir>/content/images.\n\nThis content directory functions the same, and exists in the same place as in\nprevious Ghost versions. After copying your files into the new /content/ \nfolder, make sure they belong to the correct Ghost user by running: \n\nsudo chown -R ghost:ghost content\n\n\n\n--------------------------------------------------------------------------------\n\nUpload your theme\nOnce your theme is fully prepared for Ghost 1.0.0 following the guidelines given\non gscan.ghost.org [https://gscan.ghost.org/], upload the final .zip  file into\nyour new Ghost install. Themes are uploaded in the design settings page inside\nof your Ghost admin. \n\nTo upload a theme manually, copy the theme into <new-ghost-dir>/content/themes.\nEnsure the folder is owned by the ghost user and run ghost restart to make Ghost\nsee it.\n\n\n--------------------------------------------------------------------------------\n\nUpdate external sites using Public API\nIf you have external sites which are using the Content API to pull data from\nGhost, you'll need to make some updates to ensure this stays working. Consult\nthe API documentation [https://docs.ghost.org/api/content/]  for further\ninformation. \n\n\n--------------------------------------------------------------------------------\n\nTroubleshooting\nIf you run into any issues or errors when upgrading to Ghost 2.0, use the search\nfunction on this site to find solutions for common issues, or head to the\ncommunity forum [https://forum.ghost.org/].\n\n\n--------------------------------------------------------------------------------\n\nSummary\nNow that you have successfully upgraded from Ghost LTS to Ghost 1.0, you can use\n ghost-cli  to upgrade to the latest version of Ghost with all of the latest\nfeatures 🎉\n\nThe 2.0.0 upgrade [https://docs.ghost.org/faq/upgrade-to-ghost-2-0/]  is\nconsiderably less manual than this one, and it's highly recommended you do this\nnow.","featured":false,"created_at_pretty":"16 October, 2018","published_at_pretty":"16 October, 2018","updated_at_pretty":"01 November, 2018","created_at":"2018-10-16T03:54:24.000+00:00","published_at":"2018-10-16T04:02:37.000+00:00","updated_at":"2018-11-01T10:07:14.000+00:00","tags":[{"name":"Self-hosting","slug":"self-hosting","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Kym Ellis","slug":"kym"}]}},{"node":{"id":"Ghost__Post__5bc1cfd194250c00bf9d3b75","slug":"upgrade-to-ghost-2-0","title":"Upgrade to Ghost 2.0","excerpt":"How to upgrade to Ghost 2.0 - with minimal breaking changes and a smooth upgrade process via the Ghost-CLI tool! ","feature_image":null,"plaintext":"Ghost 2.0 was released in September 2018 and the second major upgrade since the\nplatform launched. This update includes a new editor, a flexible configuration\nlayer called dynamic routing, and lots of exciting new features\n[https://blog.ghost.org/2-0/]. \n\nThere are minimal breaking changes for the Ghost 2.0 upgrade, which runs\nsmoothly using ghost-cli. \n\nThis guide is useful for all self-hosted Ghost users. If you are using \nGhost(Pro) [https://ghost.org/pricing/]  then you are automatically upgraded to\nthe latest version of Ghost. Why upgrade to 2.0?\nUsing the latest version of Ghost is recommended to ensure that your site is\nsecure and so that you have access to all of the latest features inside Ghost.\n\nIf you are still running a Ghost LTS version (0.x), upgrade to Ghost 1.0 before\nupgrading to 2.0 — follow the upgrading to Ghost 1.0 guide\n[https://docs.ghost.org/faq/upgrade-to-ghost-1-0/]. Here’s the current version\nhistory and end of life support [https://docs.ghost.org/faq/major-versions-lts/]\n.\n\n\n--------------------------------------------------------------------------------\n\nPrerequisites\nIt is only possible to upgrade to Ghost 2.0 from versions 1.0 or higher and the\nlatest Ghost CLI version is required to complete the upgrade. Here's a breakdown\nof the migration steps:\n\n 1. Prepare your theme\n 2. Make a backup\n 3. Install the latest Ghost CLI version\n 4. Update Ghost\n\n\n--------------------------------------------------------------------------------\n\nPrepare your theme\nThe new editor in Ghost 2.0 comes with powerful rich editing features that\nrequire additional CSS in your theme. There are minimal breaking changes to\nthemes which will require some attention prior to upgrading to 2.0.\n\nCheck theme compatibility using gscan\nThe fastest way to check your theme compatibility is using the tool gscan\n[https://gscan.ghost.org]. It allows you to upload a zip file of your current\ntheme to check for errors, deprecations and other compatibility issues.\n\n 1. Download your current active theme as a .zip from the design settings page\n    in Ghost admin\n 2. Upload this file on the gscan page [https://gscan.ghost.org]\n 3. Select 2.0.0 as the Ghost version to check your theme for this migration\n\nThe tool lists all errors and provide a full explanation and description of how\nto update your theme. All items listed as “must fix” are required to be updated\nwithin your theme for the 2.0.0 migration. Items listed as “consider fixing” are\nrecommended to ensure future upgrades are smoother. \n\nFor a full overview of the required theme support for the latest version of the\nGhost Editor, read the handlebars theme documentation\n[https://docs.ghost.org/api/handlebars-themes/content/].\n\nThe supported Ghost 2.0 migration also runs gscan in the background to check if\nyour theme is compatible before allowing the upgrade. Ensure your theme is\nupdated and uploaded to your site in Ghost admin before proceeding.\n--------------------------------------------------------------------------------\n\nBackup your content\nThe recommended Ghost 2.0 upgrade using ghost-cli  is designed to be pain free,\nbut we always recommend making a backup of your content before any major\nupgrades, particularly if you are running any form of custom install. It takes\nless than two minutes to create a full backup of your site content, so make sure\nyou follow this step.\n\nJSON export\nRetrieve an up-to-date JSON export from the Ghost admin in the labs section,\nwhich can be accessed at yourdomain.com/ghost/settings/labs/. This downloads a\nJSON export file that you can save in case of emergencies.\n\nContent folder backup\nAll user-provided data such as images and themes exist in the /content/  folder.\n\nWe strongly recommend making a copy of these files. To do this run the following\ncommand on your sever:\n\ncp -r content /tmp/content-backup\n\n\n\n--------------------------------------------------------------------------------\n\nInstall the latest Ghost CLI version\nThe Ghost 2.0 upgrade requires version 1.9.0 or higher of Ghost-CLI.\n\nIf you followed the supported install guide to production, the server setup has\na single system-wide version of node.js. The install and update command for \nghost-cli  can be used:\n\nsudo npm i -g ghost-cli@latest\n\n\nor if you used yarn:\n\nsudo yarn global add ghost-cli@latest\n\n\n\n--------------------------------------------------------------------------------\n\nUpdate Ghost\nIn your terminal cd into your publication’s directory and run the update\ncommand: ghost update. Ghost CLI checks that everything is ready for the upgrade\nand inform you if there are any extra steps required. \n\nOnce all checks have been passed the upgrade installs and you’ll be running\nGhost 2.0. \n\nChecking your theme ✅\nThe CLI will check your active theme for compatibility during the update\nprocess. Providing you followed the steps within this guide, you should see: \n\nChecking theme compatibility for Ghost 2.0.0\n\n✔ Your theme is compatible.\n\nVisit the demo post at http://localhost:2370/p/a8501e8d-0d43-49ae-81b2-e5031c98d952/ to see how your theme looks like in Ghost 2.0\nYou can also check theme compatibility at https://gscan.ghost.org\n\n? Are you sure you want to proceed with migrating to Ghost 2.0.0? (Y/n)\n\n\nOnce the migration is accepted, all existing posts have the <div\nclass=\"kg-card-markdown\">  wrapper element removed from the {{content}}  output.\n \n\nWe highly recommend opening the demo post URL to perform a final check to make\nsure the post displays as expected before proceeding with the migration. \n\n\n--------------------------------------------------------------------------------\n\nWhat to do when an upgrade fails\nThe most common reason for a failed upgrade is running out of memory. Ensure you\nhave enough memory or configure swap memory on your server. If your install\nfails and you can't find a specific solution you run ghost uninstall and then\ntry ghost install again.\n\nGhost accepts two optional flags for the ghost update  command:\n\nForce\nIf ghost update fails, the first thing to try is ghost update --force  to retry\nthe update.\n\nRollback\nIf your ghost install is in a broken state after updating, you can use\nghost update --rollback  to get back to the previous stable version.\n\nOnce you've stabilised and resolved any underlying problems, go into /version \nand remove the broken version. Then run ghost update  again. Use ghost --version \n to see what version is currently being used.\n\nIf you run into any other errors, use the search function on this site to find\ntroubleshooting guides for common issues, or head to the community forum\n[https://forum.ghost.org/].\n\n\n--------------------------------------------------------------------------------\n\nSummary\nFollowing this guide you have upgraded to Ghost 2.0 using the Ghost CLI, after\nmaking any necessary changes to your theme. You now have access to all of the\nfeatures inside Ghost 2.0.","featured":false,"created_at_pretty":"13 October, 2018","published_at_pretty":"16 October, 2018","updated_at_pretty":"30 October, 2018","created_at":"2018-10-13T10:58:25.000+00:00","published_at":"2018-10-16T03:52:42.000+00:00","updated_at":"2018-10-30T04:11:25.000+00:00","tags":[{"name":"Self-hosting","slug":"self-hosting","visibility":"public"},{"name":"#faq","slug":"hash-faq","visibility":"internal"}],"authors":[{"name":"Kym Ellis","slug":"kym"}]}}]}},"pageContext":{"tagSlug":"self-hosting","tagName":"Self-hosting","tagURL":"/faq/self-hosting/","tagDescription":"Commonly asked questions, upgrade information and guides for developers who are self-hosting an instance of Ghost!","tagImage":null,"tagMetaTitle":"Self Hosting FAQs","tagMetaDescription":"Commonly asked questions, upgrade information and guides for developers who are self-hosting an instance of Ghost!","section":"faq"}}